<details><summary>Digger run report at 2023-10-17 22:13:06 (UTC)</summary>
  <details><summary>Apply for <b>thiagonache/potential-goggles#talend</b></summary>
  
```terraform
Terraform will perform the following actions:

  # google_storage_bucket.state will be created
  + resource "google_storage_bucket" "state" {
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + location                    = "US"
      + name                        = "tnbc-bfc-sbx-ms-kxs-t8gcp-tf-state"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + versioning {
          + enabled = true
        }
    }

  # module.enable_google_apis.google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "compute.googleapis.com"
    }

  # module.enable_google_apis.google_project_service.project_services["container.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "container.googleapis.com"
    }

  # module.enable_google_apis.google_project_service.project_services["containerregistry.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "containerregistry.googleapis.com"
    }

  # module.enable_google_apis.google_project_service.project_services["datastore.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "datastore.googleapis.com"
    }

  # module.enable_google_apis.google_project_service.project_services["iam.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "iam.googleapis.com"
    }

  # module.enable_google_apis.google_project_service.project_services["logging.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "logging.googleapis.com"
    }

  # module.enable_google_apis.google_project_service.project_services["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "monitoring.googleapis.com"
    }

  # module.enable_google_apis.google_project_service.project_services["pubsub.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "pubsub.googleapis.com"
    }

  # module.enable_google_apis.google_project_service.project_services["storage.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "storage.googleapis.com"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + state_bucket  = "tnbc-bfc-sbx-ms-kxs-t8gcp-tf-state"
  + test_pr_merge = "test"
module.enable_google_apis.google_project_service.project_services["datastore.googleapis.com"]: Creating...
module.enable_google_apis.google_project_service.project_services["compute.googleapis.com"]: Creating...
module.enable_google_apis.google_project_service.project_services["iam.googleapis.com"]: Creating...
module.enable_google_apis.google_project_service.project_services["storage.googleapis.com"]: Creating...
module.enable_google_apis.google_project_service.project_services["logging.googleapis.com"]: Creating...
google_storage_bucket.state: Creating...
module.enable_google_apis.google_project_service.project_services["containerregistry.googleapis.com"]: Creating...
module.enable_google_apis.google_project_service.project_services["container.googleapis.com"]: Creating...
module.enable_google_apis.google_project_service.project_services["monitoring.googleapis.com"]: Creating...
module.enable_google_apis.google_project_service.project_services["pubsub.googleapis.com"]: Creating...
google_storage_bucket.state: Creation complete after 1s [id=tnbc-bfc-sbx-ms-kxs-t8gcp-tf-state]
module.enable_google_apis.google_project_service.project_services["storage.googleapis.com"]: Creation complete after 4s [id=bfc-sbx-tc-kxs-t8gcp-c2b5/storage.googleapis.com]
module.enable_google_apis.google_project_service.project_services["container.googleapis.com"]: Creation complete after 4s [id=bfc-sbx-tc-kxs-t8gcp-c2b5/container.googleapis.com]
module.enable_google_apis.google_project_service.project_services["monitoring.googleapis.com"]: Creation complete after 4s [id=bfc-sbx-tc-kxs-t8gcp-c2b5/monitoring.googleapis.com]
module.enable_google_apis.google_project_service.project_services["logging.googleapis.com"]: Creation complete after 4s [id=bfc-sbx-tc-kxs-t8gcp-c2b5/logging.googleapis.com]
module.enable_google_apis.google_project_service.project_services["pubsub.googleapis.com"]: Creation complete after 4s [id=bfc-sbx-tc-kxs-t8gcp-c2b5/pubsub.googleapis.com]
module.enable_google_apis.google_project_service.project_services["iam.googleapis.com"]: Creation complete after 4s [id=bfc-sbx-tc-kxs-t8gcp-c2b5/iam.googleapis.com]
module.enable_google_apis.google_project_service.project_services["compute.googleapis.com"]: Creation complete after 4s [id=bfc-sbx-tc-kxs-t8gcp-c2b5/compute.googleapis.com]
module.enable_google_apis.google_project_service.project_services["containerregistry.googleapis.com"]: Creation complete after 4s [id=bfc-sbx-tc-kxs-t8gcp-c2b5/containerregistry.googleapis.com]
module.enable_google_apis.google_project_service.project_services["datastore.googleapis.com"]: Creation complete after 4s [id=bfc-sbx-tc-kxs-t8gcp-c2b5/datastore.googleapis.com]

Apply complete! Resources: 10 added, 0 changed, 0 destroyed.

Outputs:

state_bucket = "tnbc-bfc-sbx-ms-kxs-t8gcp-tf-state"
test_pr_merge = "test"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # google_storage_bucket.state will be created%0A  + resource "google_storage_bucket" "state" {%0A      + force_destroy               = false%0A      + id                          = (known after apply)%0A      + labels                      = (known after apply)%0A      + location                    = "US"%0A      + name                        = "tnbc-bfc-sbx-ms-kxs-t8gcp-tf-state"%0A      + project                     = (known after apply)%0A      + public_access_prevention    = (known after apply)%0A      + self_link                   = (known after apply)%0A      + storage_class               = "STANDARD"%0A      + uniform_bucket_level_access = (known after apply)%0A      + url                         = (known after apply)%0A%0A      + versioning {%0A          + enabled = true%0A        }%0A    }%0A%0A  # module.enable_google_apis.google_project_service.project_services["compute.googleapis.com"] will be created%0A  + resource "google_project_service" "project_services" {%0A      + disable_dependent_services = true%0A      + disable_on_destroy         = false%0A      + id                         = (known after apply)%0A      + service                    = "compute.googleapis.com"%0A    }%0A%0A  # module.enable_google_apis.google_project_service.project_services["container.googleapis.com"] will be created%0A  + resource "google_project_service" "project_services" {%0A      + disable_dependent_services = true%0A      + disable_on_destroy         = false%0A      + id                         = (known after apply)%0A      + service                    = "container.googleapis.com"%0A    }%0A%0A  # module.enable_google_apis.google_project_service.project_services["containerregistry.googleapis.com"] will be created%0A  + resource "google_project_service" "project_services" {%0A      + disable_dependent_services = true%0A      + disable_on_destroy         = false%0A      + id                         = (known after apply)%0A      + service                    = "containerregistry.googleapis.com"%0A    }%0A%0A  # module.enable_google_apis.google_project_service.project_services["datastore.googleapis.com"] will be created%0A  + resource "google_project_service" "project_services" {%0A      + disable_dependent_services = true%0A      + disable_on_destroy         = false%0A      + id                         = (known after apply)%0A      + service                    = "datastore.googleapis.com"%0A    }%0A%0A  # module.enable_google_apis.google_project_service.project_services["iam.googleapis.com"] will be created%0A  + resource "google_project_service" "project_services" {%0A      + disable_dependent_services = true%0A      + disable_on_destroy         = false%0A      + id                         = (known after apply)%0A      + service                    = "iam.googleapis.com"%0A    }%0A%0A  # module.enable_google_apis.google_project_service.project_services["logging.googleapis.com"] will be created%0A  + resource "google_project_service" "project_services" {%0A      + disable_dependent_services = true%0A      + disable_on_destroy         = false%0A      + id                         = (known after apply)%0A      + service                    = "logging.googleapis.com"%0A    }%0A%0A  # module.enable_google_apis.google_project_service.project_services["monitoring.googleapis.com"] will be created%0A  + resource "google_project_service" "project_services" {%0A      + disable_dependent_services = true%0A      + disable_on_destroy         = false%0A      + id                         = (known after apply)%0A      + service                    = "monitoring.googleapis.com"%0A    }%0A%0A  # module.enable_google_apis.google_project_service.project_services["pubsub.googleapis.com"] will be created%0A  + resource "google_project_service" "project_services" {%0A      + disable_dependent_services = true%0A      + disable_on_destroy         = false%0A      + id                         = (known after apply)%0A      + service                    = "pubsub.googleapis.com"%0A    }%0A%0A  # module.enable_google_apis.google_project_service.project_services["storage.googleapis.com"] will be created%0A  + resource "google_project_service" "project_services" {%0A      + disable_dependent_services = true%0A      + disable_on_destroy         = false%0A      + id                         = (known after apply)%0A      + service                    = "storage.googleapis.com"%0A    }%0A%0APlan: 10 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + state_bucket  = "tnbc-bfc-sbx-ms-kxs-t8gcp-tf-state"%0A  + test_pr_merge = "test"%0Amodule.enable_google_apis.google_project_service.project_services["datastore.googleapis.com"]: Creating...%0Amodule.enable_google_apis.google_project_service.project_services["compute.googleapis.com"]: Creating...%0Amodule.enable_google_apis.google_project_service.project_services["iam.googleapis.com"]: Creating...%0Amodule.enable_google_apis.google_project_service.project_services["storage.googleapis.com"]: Creating...%0Amodule.enable_google_apis.google_project_service.project_services["logging.googleapis.com"]: Creating...%0Agoogle_storage_bucket.state: Creating...%0Amodule.enable_google_apis.google_project_service.project_services["containerregistry.googleapis.com"]: Creating...%0Amodule.enable_google_apis.google_project_service.project_services["container.googleapis.com"]: Creating...%0Amodule.enable_google_apis.google_project_service.project_services["monitoring.googleapis.com"]: Creating...%0Amodule.enable_google_apis.google_project_service.project_services["pubsub.googleapis.com"]: Creating...%0Agoogle_storage_bucket.state: Creation complete after 1s [id=tnbc-bfc-sbx-ms-kxs-t8gcp-tf-state]%0Amodule.enable_google_apis.google_project_service.project_services["storage.googleapis.com"]: Creation complete after 4s [id=bfc-sbx-tc-kxs-t8gcp-c2b5/storage.googleapis.com]%0Amodule.enable_google_apis.google_project_service.project_services["container.googleapis.com"]: Creation complete after 4s [id=bfc-sbx-tc-kxs-t8gcp-c2b5/container.googleapis.com]%0Amodule.enable_google_apis.google_project_service.project_services["monitoring.googleapis.com"]: Creation complete after 4s [id=bfc-sbx-tc-kxs-t8gcp-c2b5/monitoring.googleapis.com]%0Amodule.enable_google_apis.google_project_service.project_services["logging.googleapis.com"]: Creation complete after 4s [id=bfc-sbx-tc-kxs-t8gcp-c2b5/logging.googleapis.com]%0Amodule.enable_google_apis.google_project_service.project_services["pubsub.googleapis.com"]: Creation complete after 4s [id=bfc-sbx-tc-kxs-t8gcp-c2b5/pubsub.googleapis.com]%0Amodule.enable_google_apis.google_project_service.project_services["iam.googleapis.com"]: Creation complete after 4s [id=bfc-sbx-tc-kxs-t8gcp-c2b5/iam.googleapis.com]%0Amodule.enable_google_apis.google_project_service.project_services["compute.googleapis.com"]: Creation complete after 4s [id=bfc-sbx-tc-kxs-t8gcp-c2b5/compute.googleapis.com]%0Amodule.enable_google_apis.google_project_service.project_services["containerregistry.googleapis.com"]: Creation complete after 4s [id=bfc-sbx-tc-kxs-t8gcp-c2b5/containerregistry.googleapis.com]%0Amodule.enable_google_apis.google_project_service.project_services["datastore.googleapis.com"]: Creation complete after 4s [id=bfc-sbx-tc-kxs-t8gcp-c2b5/datastore.googleapis.com]%0A%0AApply complete! Resources: 10 added, 0 changed, 0 destroyed.%0A%0AOutputs:%0A%0Astate_bucket = "tnbc-bfc-sbx-ms-kxs-t8gcp-tf-state"%0Atest_pr_merge = "test"%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
</details>
</details>